xml/tsung.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd" [
  <!ENTITY scenario1.bag SYSTEM "record-data/scenario1.bag.xml">
  <!ENTITY scenario1.watch SYSTEM "record-data/scenario1.watch.xml">
]>
<tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" maxusers="5000" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="10.77.77.112" port="8000" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="20" unit="second">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="20" unit="second">
      <users arrivalrate="50" unit="second"></users>
    </arrivalphase>
  </load>

  <sessions>
    <session name='wordpress' probability='100' type='ts_http'>

<request><http url='http://10.77.77.112:8000/' version='1.1' method='GET'>
  <http_header name='Accept' value='text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-content/themes/twentyseventeen/style.css?ver=4.9' version='1.1' method='GET'>
  <http_header name='Accept' value='text/css,*/*;q=0.1' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-includes/js/jquery/jquery.js?ver=1.12.4' version='1.1' method='GET'>
  <http_header name='Accept' value='*/*' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-includes/js/jquery/jquery-migrate.min.js?ver=1.4.1' version='1.1' method='GET'>
  <http_header name='Accept' value='*/*' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-content/themes/twentyseventeen/assets/js/skip-link-focus-fix.js?ver=1.0' version='1.1' method='GET'>
  <http_header name='Accept' value='*/*' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-content/themes/twentyseventeen/assets/js/global.js?ver=1.0' version='1.1' method='GET'>
  <http_header name='Accept' value='*/*' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-content/themes/twentyseventeen/assets/js/jquery.scrollTo.js?ver=2.1.2' version='1.1' method='GET'>
  <http_header name='Accept' value='*/*' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-includes/js/wp-embed.min.js?ver=4.9' version='1.1' method='GET'>
  <http_header name='Accept' value='*/*' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-includes/js/wp-emoji-release.min.js?ver=4.9' version='1.1' method='GET'>
  <http_header name='Accept' value='*/*' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-content/themes/twentyseventeen/assets/images/header.jpg' version='1.1' method='GET'>
  <http_header name='Accept' value='*/*' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>

<thinktime random='true' value='3'/>

<request><http url='/2017/11/25/hello-world/' version='1.1' method='GET'>
  <http_header name='Accept' value='text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-includes/js/comment-reply.min.js?ver=4.9' version='1.1' method='GET'>
  <http_header name='Accept' value='*/*' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>

<thinktime random='true' value='2'/>

<request><http url='/wp-login.php' version='1.1' method='GET'>
  <http_header name='Accept' value='text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-admin/load-styles.php?c=0&amp;dir=ltr&amp;load%5B%5D=dashicons,buttons,forms,l10n,login&amp;ver=4.9' version='1.1' method='GET'>
  <http_header name='Accept' value='text/css,*/*;q=0.1' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-admin/images/wordpress-logo.svg?ver=20131107' version='1.1' method='GET'>
  <http_header name='Accept' value='*/*' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>

<thinktime random='true' value='4'/>

<request><http url='/wp-login.php' version='1.1'  contents='log=winggundamth&amp;pwd=P%40ssw0rd&amp;wp-submit=Log+In&amp;redirect_to=http%3A%2F%2F10.77.77.112%3A8000%2Fwp-admin%2F&amp;testcookie=1' content_type='application/x-www-form-urlencoded' method='POST'>
  <http_header name='Accept' value='text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-admin/' version='1.1' method='GET'>
  <http_header name='Accept' value='text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-admin/load-styles.php?c=0&amp;dir=ltr&amp;load%5B%5D=dashicons,admin-bar,common,forms,admin-menu,dashboard,list-tables,edit,revisions,media,themes,about,nav-menus,wp-pointer,widgets&amp;load%5B%5D=,site-icon,l10n,buttons,wp-auth-check&amp;ver=4.9' version='1.1' method='GET'>
  <http_header name='Accept' value='text/css,*/*;q=0.1' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-admin/load-scripts.php?c=0&amp;load%5B%5D=jquery-core,jquery-migrate,utils&amp;ver=4.9' version='1.1' method='GET'>
  <http_header name='Accept' value='*/*' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-includes/js/thickbox/thickbox.css?ver=4.9' version='1.1' method='GET'>
  <http_header name='Accept' value='text/css,*/*;q=0.1' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-includes/css/editor.min.css?ver=4.9' version='1.1' method='GET'>
  <http_header name='Accept' value='text/css,*/*;q=0.1' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-admin/load-scripts.php?c=0&amp;load%5B%5D=hoverIntent,common,admin-bar,wp-ajax-response,jquery-color,wp-lists,quicktags,jquery-query,admin-comments,jquery-ui-core,jquery-&amp;load%5B%5D=ui-widget,jquery-ui-mouse,jquery-ui-sortable,postbox,underscore,wp-util,wp-a11y,dashboard,thickbox,plugin-install,updates,shortc&amp;load%5B%5D=ode,media-upload,svg-painter,heartbeat,wp-auth-check,wplink,jquery-ui-position,jquery-ui-menu,jquery-ui-autocomplete&amp;ver=4.9' version='1.1' method='GET'>
  <http_header name='Accept' value='*/*' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>
<request><http url='/wp-includes/js/thickbox/loadingAnimation.gif' version='1.1' method='GET'>
  <http_header name='Accept' value='*/*' />
  <http_header name='Accept-Encoding' value='gzip, deflate' />
  <http_header name='Accept-Language' value='en-US,en;q=0.5' /></http></request>

    </session>
  </sessions>
</tsung>